Repository: MohamedAlkindi/FlowAI
Catalog: lib/l10n/arb/app_*.arb
Languages: ar

# ai_tagline
source: AI-powered text generation
ar: توليد نصوص بالذكاء الاصطناعي

# welcome_title_1
source: Welcome to FlowAI
ar: مرحبًا بك في FlowAI

# welcome_sub_1
source: Seamlessly integrate AI-powered text generation into any text input field system-wide.
ar: دمج سلس لتوليد النصوص بالذكاء الاصطناعي في أي حقل إدخال على مستوى النظام.

# welcome_title_2
source: Type /ai to Generate
ar: اكتب /ai للتوليد

# welcome_sub_2
source: Simply type "/ai" followed by your prompt and ending with / in any text field to get AI-generated content instantly.
ar: اكتب "/ai" متبوعًا بطلبك ثم أغلق بـ / في أي حقل نصي لتحصل فورًا على نص مولّد.

# welcome_title_3
source: No App Switching
ar: بدون تبديل التطبيقات

# welcome_sub_3
source: Stay in your flow. Generate text without leaving your current app or breaking your typing rhythm.
ar: ابقَ في تدفقك. ولّد النص دون مغادرة تطبيقك أو قطع تسلسل الكتابة.

source: Next
ar: التالي

source: Get Started
ar: ابدأ

source: Skip
ar: تخطي

source: Refresh Status
ar: حدّث الحالة

# status_active
source: Service Active
ar: الخدمة مفعّلة

# status_inactive
source: Service Inactive
ar: الخدمة غير مفعّلة

# status_ready
source: FlowAI is ready to assist you
ar: FlowAI جاهز لمساعدتك

# status_enable
source: Enable accessibility service to start using AI features, swipe down to refresh
ar: فعّل خدمة الوصول لتبدأ استخدام مزايا الذكاء الاصطناعي اضغط على زر التحديث اعلاه للتحديث

source: Status refreshed
ar: حدّث الحالة

# accessibility
source: Accessibility Service
ar: خدمة تسهيلات الاستخدام

# accessibility_desc
source: This service monitors text input fields to detect /ai commands and provide AI-powered text generation.
ar: تراقب هذه الخدمة حقول الإدخال لاكتشاف أوامر /ai وتوفير توليد النصوص بالذكاء الاصطناعي.

# manage_in_settings
source: Service is Enabled️ ✓
ar: إدارة من الإعدادات

source: Enable Service
ar: تفعيل الخدمة

source: Edge Function Test
ar: اختبار وظيفة الحافة

# prompt_hint
source: Enter a prompt to send to Edge Function
ar: أدخل طلبًا لإرساله إلى وظيفة الحافة

source: Calling…
ar: جارٍ الاتصال…

# call_edge
source: Call Edge Function
ar: اتصل بوظيفة الحافة

source: How to Use
ar: كيفية الاستخدام

# step_1_t
source: Type /ai in any text field
ar: افتراضياً، اكتب /ai في أي حق نصّي او قمت بتغيير الاعدادات عن طريق الضغط على زر الاعدادات أعلاه

# step_1_d
source: By default start your prompt with /ai followed by your request and end it with /, or change it by pressing the settings button up there.
ar: ابدأ طلبك بـ /ai متبوعًا بما تريد ثم أغلق باستخدام /

# step_2_t
source: Watch "..." while generating
ar: راقب "..." أثناء التوليد

# step_2_d
source: FlowAI will stream the AI response in the text field
ar: سيعرض FlowAI الاستجابة مباشرة في حقل النص

# step_3_t
source: Continue typing
ar: واصل الكتابة

# step_3_d
source: Seamlessly continue with your workflow
ar: تابع عملك بسلاسة

# step_4_t
source: Grant Overlay Permission 'Optional'
ar: امنح اذن العرض على التطبيقات 'اختياري'

# step_4_d
source: Go to Settings > Apps > FlowAI > Permissions > Display over other apps and enable it. This allows the AI bubble to appear over other apps.
ar: انتقل إلى الإعدادات > التطبيقات > FlowAI > الأذونات > العرض فوق التطبيقات الأخرى، ثم فعّله. يسمح هذا لفقاعة الذكاء الاصطناعي بالظهور فوق التطبيقات الأخرى.

# step_5_t
source: Use the AI Bubble
ar: استخدم فقاعة الذكاء الاصطناعي

# step_5_d
source: Type your trigger (e.g., /ai your prompt /) in any app. The AI bubble will appear, showing your prompt, the AI result, and Apply/Cancel/Redo buttons.
ar: اكتب الأمر الخاص بك (مثلاً، /ai your prompt /) في أي تطبيق. ستظهر فقاعة الذكاء الاصطناعي، مع عرض الأمر الخاص بك، ونتيجة الذكاء الاصطناعي، وأزرار 'تطبيق/إلغاء/إعادة'.

# open_settings
source: Open Accessibility settings
ar: افتح إعدادات تسهيلات الاستخدام

# enter_prompt_first
source: Enter a prompt first
ar: أدخل طلبًا أولًا

source: Response received
ar: تم استلام الاستجابة

# oem_card_title
source: How to enable service and keep it active
ar: كيفية تفعيل الخدمة وابقاؤها مُفعّلة

# xiaomi_heading
source: Xiaomi / Redmi (MIUI)
ar: شاومي / ريدمي (MIUI)

# xiaomi_step_1_t
source: Allow unrestricted accessibility
ar: السماح بإمكانية الوصول دون قيود

# xiaomi_step_1_d
source: Settings → Apps → FlowAI → More permissions → Allow Accessibility always (or disable MIUI optimizations that block it).
ar: الإعدادات → التطبيقات → FlowAI → أذونات إضافية → السماح دائمًا لإمكانية الوصول (أو تعطيل تحسينات MIUI التي تمنعها).

# xiaomi_step_2_t
source: Disable battery restrictions
ar: تعطيل قيود البطارية

# xiaomi_step_2_d
source: Settings → Battery → App battery saver → FlowAI → No restrictions.
ar: الإعدادات → البطارية → موفر بطارية التطبيق → FlowAI → بدون قيود.

# xiaomi_step_3_t
source: Lock app in recents (optional)
ar: قفل التطبيق في المهام الحديثة (اختياري)

# xiaomi_step_3_d
source: Open recent apps → long-press FlowAI → lock/pin so MIUI doesn't kill it.
ar: افتح التطبيقات الحديثة → اضغط مطولًا على FlowAI → قفل/تثبيت حتى لا يقوم MIUI بإيقافه.

# samsung_heading
source: Samsung (One UI)
ar: سامسونج (One UI)

# samsung_step_1_t
source: Enable restricted settings
ar: تفعيل الإعدادات المقيّدة

# samsung_step_1_d
source: Settings → Apps → FlowAI → More options (⋮) → Allow restricted settings, then enable Accessibility again.
ar: الإعدادات → التطبيقات → FlowAI → المزيد (⋮) → السماح بالإعدادات المقيّدة، ثم فعّل إمكانية الوصول مرة أخرى.

# samsung_step_2_t
source: Exclude from battery optimization
ar: استثناء من تحسين البطارية

# samsung_step_2_d
source: Settings → Battery → Background usage limits → Never sleeping apps → Add FlowAI.
ar: الإعدادات → البطارية → حدود استخدام الخلفية → التطبيقات التي لا تنام أبدًا → أضف FlowAI.

# samsung_step_3_t
source: Keep service active
ar: الحفاظ على الخدمة مفعّلة

# samsung_step_3_d
source: Settings → Accessibility → Installed services → FlowAI → ensure it's On. If it turns off after reboot, repeat the steps above.
ar: الإعدادات → تسهيلات الاستخدام → الخدمات المثبتة → FlowAI → تأكد أنها مفعّلة. إذا تعطّلت بعد إعادة التشغيل، أعد الخطوات أعلاه.

# troubleshooting_title
source: Troubleshooting (Common Issues)
ar: استكشاف الأخطاء الشائعة

# ts_issue_1_t
source: Service turns off by itself
ar: الخدمة تُغلق من تلقاء نفسها

# ts_issue_1_d
source: Disable battery optimizations and background limits for FlowAI. Re-enable Accessibility after adjusting OEM restrictions.
ar: عطّل تحسينات البطارية وحدود الخلفية لتطبيق FlowAI. ثم أعد تفعيل إمكانية الوصول بعد تعديل قيود الشركة المصنعة.

# ts_issue_2_t
source: No response after typing /ai
ar: لا توجد استجابة بعد كتابة /ai

# ts_issue_2_d
source: Check your current settings, by clicking the gear icon on the top right.
ar: تأكد من إنهاء الطلب بشرطة مائلة في النهاية `/`. مثال: ‎/ai اكتب رسالة بريد/.

# ts_issue_3_t
source: Service enabled but not working
ar: الخدمة مفعّلة ولكن لا تعمل

# ts_issue_3_d
source: Toggle the service Off then On again in Settings → Accessibility → Installed services → FlowAI.
ar: أوقف الخدمة ثم أعد تشغيلها من الإعدادات → تسهيلات الاستخدام → الخدمات المثبتة → FlowAI.

# ts_issue_4_t
source: Slow or partial responses
ar: استجابة بطيئة أو جزئية

# ts_issue_4_d
source: Check network connectivity. Some OEMs throttle background network; remove FlowAI from sleeping apps.
ar: تحقق من الاتصال بالإنترنت. بعض الأجهزة تحد من الشبكة في الخلفية؛ أزل FlowAI من قائمة التطبيقات النائمة.

# ts_issue_5_t
source: Daily limit or too many requests
ar: تجاوز الحد اليومي أو كثرة الطلبات

# ts_issue_5_d
source: If you see limit messages, wait and try later. Heavy usage may hit per-minute or daily caps.
ar: إذا ظهرت رسائل حدود الاستخدام، انتظر قليلاً وحاول لاحقًا. قد تصل الاستخدامات الكثيفة إلى حدود في الدقيقة أو اليوم.

# oem_unknown_hint
source: Please search online for how to enable restricted settings, disable battery optimization, and keep accessibility services running for your specific device/OS version.
ar: الرجاء البحث على الإنترنت عن كيفية تفعيل الإعدادات المقيّدة، تعطيل تحسين البطارية، والحفاظ على خدمات تسهيلات الاستخدام فعّالة لجهازك وإصدار النظام.

source: Set Custom Trigger
ar: تغيير الاعدادات الافتراضية

# currentSettings
source: Current Trigger Settings
ar: الاعدادات الحالية

# text
source: prompt here
ar: نَص

source: Start Trigger
ar: بدء التفعيل

source: End Trigger
ar: انهاء التفعيل

source: Cancel
ar: الغاء

source: Save
ar: حفظ

source: Done!
ar: تم!

source: Customize Triggers
ar: حدّث التفعيلات

source: Grant Permission
ar: تفعيل الامكانية

source: Later
ar: ﻻحقاً

# overlayDisplayPermissionTitle
source: Overlay Permission 'Optional'
ar: اذن العرض على تطفيقات أخرى 'اختياري'
